[NoCoverage] LogicalOperator
src/server.ts:5:14
 
 const app = express();
 const DEFAULT_PORT = 3000;
-const PORT = process.env['PORT'] ?? DEFAULT_PORT;
+const PORT = process.env['PORT'] && DEFAULT_PORT;
 
 app.get('/', (_req, res) => {

[NoCoverage] BlockStatement
src/server.ts:7:29
 const DEFAULT_PORT = 3000;
 const PORT = process.env['PORT'] ?? DEFAULT_PORT;
 
-app.get('/', (_req, res) => {
-  res.json({ message: 'MCP Server Platform' });
-});
+app.get('/', (_req, res) => {});
 
 app.listen(PORT, () => {

[NoCoverage] StringLiteral
src/server.ts:7:9
 const DEFAULT_PORT = 3000;
 const PORT = process.env['PORT'] ?? DEFAULT_PORT;
 
-app.get('/', (_req, res) => {
+app.get("", (_req, res) => {
   res.json({ message: 'MCP Server Platform' });
 });

[NoCoverage] ObjectLiteral
src/server.ts:8:12
 const PORT = process.env['PORT'] ?? DEFAULT_PORT;
 
 app.get('/', (_req, res) => {
-  res.json({ message: 'MCP Server Platform' });
+  res.json({});
 });
 

[NoCoverage] BlockStatement
src/server.ts:11:24
   res.json({ message: 'MCP Server Platform' });
 });
 
-app.listen(PORT, () => {
-  console.log(`Server running on port ${PORT}`);
-});
+app.listen(PORT, () => {});
 
