[Killed] BlockStatement
mcps/slack/services/slack-client.ts:9:17
   private readonly client: WebClient;
 
   constructor(token: string) {
-    if (!token) {
-      throw new Error('Slack bot token is required');
-    }
+    if (!token) {}
     this.client = new WebClient(token);
   }
killedBy: SlackClient constructor should throw error with empty token
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:9:9
   private readonly client: WebClient;
 
   constructor(token: string) {
-    if (!token) {
+    if (true) {
       throw new Error('Slack bot token is required');
     }
killedBy: SlackClient constructor should create instance with valid token
statusReason: Slack bot token is required

[Killed] ObjectLiteral
mcps/slack/services/slack-client.ts:21:28
     const response = await this.client.search.messages({
       query,
       count: params.limit ?? SlackClient.DEFAULT_LIMIT,
-      ...(params.cursor && { cursor: params.cursor }),
+      ...(params.cursor && {}),
     });
 
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
mcps/slack/services/slack-client.ts:31:29
     const matches = response.messages.matches ?? [];
     const results: SlackMessage[] = matches.map((match) => ({
       text: match.text ?? '',
-      author: match.user ?? '',
+      author: match.user ?? "Stryker was here!",
       channel:
         typeof match.channel === 'object' && match.channel !== null ? (match.channel.id ?? '') : '',
killedBy: SlackClient searchMessages should transform messages with missing or null fields
statusReason: expected { text: '', …(3) } to deeply equal { text: '', author: '', …(2) }

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:33:46
       text: match.text ?? '',
       author: match.user ?? '',
       channel:
-        typeof match.channel === 'object' && match.channel !== null ? (match.channel.id ?? '') : '',
+        typeof match.channel === 'object' && true ? (match.channel.id ?? '') : '',
       timestamp: match.ts ?? '',
     }));
killedBy: SlackClient searchMessages should transform messages with missing or null fields
statusReason: Cannot read properties of null (reading 'id')

[Killed] StringLiteral
mcps/slack/services/slack-client.ts:33:98
       text: match.text ?? '',
       author: match.user ?? '',
       channel:
-        typeof match.channel === 'object' && match.channel !== null ? (match.channel.id ?? '') : '',
+        typeof match.channel === 'object' && match.channel !== null ? (match.channel.id ?? '') : "Stryker was here!",
       timestamp: match.ts ?? '',
     }));
killedBy: SlackClient searchMessages should transform messages with missing or null fields
statusReason: expected { text: '', author: '', …(2) } to deeply equal { text: '', author: '', …(2) }

[Killed] StringLiteral
mcps/slack/services/slack-client.ts:34:30
       author: match.user ?? '',
       channel:
         typeof match.channel === 'object' && match.channel !== null ? (match.channel.id ?? '') : '',
-      timestamp: match.ts ?? '',
+      timestamp: match.ts ?? "Stryker was here!",
     }));
 
killedBy: SlackClient searchMessages should transform messages with missing or null fields
statusReason: expected { text: '', author: '', …(2) } to deeply equal { text: '', author: '', …(2) }

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:45:26
   private buildSearchQuery(params: SlackSearchParams): string {
     let query = params.query;
 
-    if (params.fromDate) {
-      query += ` after:${params.fromDate}`;
-    }
+    if (params.fromDate) {}
     if (params.toDate) {
       query += ` before:${params.toDate}`;
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:45:9
   private buildSearchQuery(params: SlackSearchParams): string {
     let query = params.query;
 
-    if (params.fromDate) {
+    if (false) {
       query += ` after:${params.fromDate}`;
     }
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:48:9
     if (params.fromDate) {
       query += ` after:${params.fromDate}`;
     }
-    if (params.toDate) {
+    if (false) {
       query += ` before:${params.toDate}`;
     }
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:48:24
     if (params.fromDate) {
       query += ` after:${params.fromDate}`;
     }
-    if (params.toDate) {
-      query += ` before:${params.toDate}`;
-    }
+    if (params.toDate) {}
     if (params.userId) {
       query += ` from:${params.userId}`;
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:51:24
     if (params.toDate) {
       query += ` before:${params.toDate}`;
     }
-    if (params.userId) {
-      query += ` from:${params.userId}`;
-    }
+    if (params.userId) {}
     if (params.hasReactions) {
       query += ' has:reaction';
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:51:9
     if (params.toDate) {
       query += ` before:${params.toDate}`;
     }
-    if (params.userId) {
+    if (true) {
       query += ` from:${params.userId}`;
     }
killedBy: SlackClient searchMessages should use default limit of 20 when limit is not provided
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', count: 20 } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:54:30
     if (params.userId) {
       query += ` from:${params.userId}`;
     }
-    if (params.hasReactions) {
-      query += ' has:reaction';
-    }
+    if (params.hasReactions) {}
     if (params.hasThreads) {
       query += ' has:thread';
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:54:9
     if (params.userId) {
       query += ` from:${params.userId}`;
     }
-    if (params.hasReactions) {
+    if (false) {
       query += ' has:reaction';
     }
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:57:9
     if (params.hasReactions) {
       query += ' has:reaction';
     }
-    if (params.hasThreads) {
+    if (false) {
       query += ' has:thread';
     }
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:57:28
     if (params.hasReactions) {
       query += ' has:reaction';
     }
-    if (params.hasThreads) {
-      query += ' has:thread';
-    }
+    if (params.hasThreads) {}
 
     return query;
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {
