[Killed] MethodExpression
src/shared/config.ts:9:25
 }
 
 export const validateConfig = (): AppConfig => {
-  const slackBotToken = process.env['SLACK_BOT_TOKEN']?.trim();
+  const slackBotToken = process.env['SLACK_BOT_TOKEN'];
 
   if (!slackBotToken) {
killedBy: validateConfig should trim whitespace from SLACK_BOT_TOKEN
statusReason: expected '  xoxb-test-token  ' to be 'xoxb-test-token' // Object.is equality
