[Survived] StringLiteral
src/mcps/slack/index.ts:7:24
 import { createSearchMessagesHandler, searchMessagesSchema } from './tools/search-messages.js';
 
 const SERVER_NAME = 'slack-mcp';
-const SERVER_VERSION = '1.0.0';
+const SERVER_VERSION = "";
 
 export const createSlackMcpServer = (botToken: string): McpServer => {

[Killed] StringLiteral
src/mcps/slack/index.ts:31:5
 
   // Register search_messages tool
   server.registerTool(
-    'search_messages',
+    "",
     {
       description:
killedBy: createSlackMcpServer should register tools and make them discoverable via tools/list
statusReason: expected undefined to be defined
