[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:14:9
   private readonly client: WebClient;
 
   constructor(token: string) {
-    if (!token) {
+    if (false) {
       throw new Error('Slack bot token is required');
     }
killedBy: SlackClient constructor should throw error with empty token
statusReason: expected [Function] to throw an error

[Killed] BooleanLiteral
mcps/slack/services/slack-client.ts:14:9
   private readonly client: WebClient;
 
   constructor(token: string) {
-    if (!token) {
+    if (token) {
       throw new Error('Slack bot token is required');
     }
killedBy: SlackClient constructor should create instance with valid token
statusReason: Slack bot token is required

[Killed] ObjectLiteral
mcps/slack/services/slack-client.ts:38:21
     const response = await this.client.search.messages({
       query,
       count: limit ?? SlackClient.DEFAULT_LIMIT,
-      ...(cursor && { cursor }),
+      ...(cursor && {}),
     });
 
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:62:9
   private buildSearchQuery(params: SlackSearchParams, channelId?: string): string {
     let query = params.query;
 
-    if (params.fromDate) {
+    if (true) {
       query += ` after:${params.fromDate}`;
     }
killedBy: SlackClient searchMessages should use default limit of 20 when limit is not provided
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', count: 20 } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:65:9
     if (params.fromDate) {
       query += ` after:${params.fromDate}`;
     }
-    if (params.toDate) {
+    if (true) {
       query += ` before:${params.toDate}`;
     }
killedBy: SlackClient searchMessages should use default limit of 20 when limit is not provided
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', count: 20 } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:68:9
     if (params.toDate) {
       query += ` before:${params.toDate}`;
     }
-    if (params.userId) {
+    if (false) {
       query += ` from:${params.userId}`;
     }
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] StringLiteral
mcps/slack/services/slack-client.ts:69:16
       query += ` before:${params.toDate}`;
     }
     if (params.userId) {
-      query += ` from:${params.userId}`;
+      query += ``;
     }
     if (params.hasReactions) {
killedBy: SlackClient searchMessages should build query with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { …(3) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:71:9
     if (params.userId) {
       query += ` from:${params.userId}`;
     }
-    if (params.hasReactions) {
+    if (true) {
       query += ' has:reaction';
     }
killedBy: SlackClient searchMessages should use default limit of 20 when limit is not provided
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', count: 20 } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:74:9
     if (params.hasReactions) {
       query += ' has:reaction';
     }
-    if (params.hasThreads) {
+    if (true) {
       query += ' has:thread';
     }
killedBy: SlackClient searchMessages should use default limit of 20 when limit is not provided
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', count: 20 } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] BlockStatement
mcps/slack/services/slack-client.ts:77:20
     if (params.hasThreads) {
       query += ' has:thread';
     }
-    if (channelId) {
-      query += ` in:${channelId}`;
-    }
+    if (channelId) {}
 
     return query;
killedBy: SlackClient searchInChannel should search in specific channel
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test in:C123', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {

[Killed] ConditionalExpression
mcps/slack/services/slack-client.ts:77:9
     if (params.hasThreads) {
       query += ' has:thread';
     }
-    if (channelId) {
+    if (false) {
       query += ` in:${channelId}`;
     }
killedBy: SlackClient searchInChannel should search in specific channel
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test in:C123', …(2) } ]

Received: 

  1st vi.fn() call:

  [
    {
