[Survived] MethodExpression
mcps/slack/tools/search-in-channel.ts:9:10
 const MIN_LIMIT = 1;
 
 export const searchInChannelSchema = z.object({
-  query: z.string().min(1, 'Query cannot be empty'),
+  query: z.string().max(1, 'Query cannot be empty'),
   channel_id: z.string().min(1, 'Channel ID is required'),
   limit: z

[Survived] MethodExpression
mcps/slack/tools/search-in-channel.ts:10:15
 
 export const searchInChannelSchema = z.object({
   query: z.string().min(1, 'Query cannot be empty'),
-  channel_id: z.string().min(1, 'Channel ID is required'),
+  channel_id: z.string().max(1, 'Channel ID is required'),
   limit: z
     .number()

[Survived] MethodExpression
mcps/slack/tools/search-in-channel.ts:11:10
 export const searchInChannelSchema = z.object({
   query: z.string().min(1, 'Query cannot be empty'),
   channel_id: z.string().min(1, 'Channel ID is required'),
-  limit: z
-    .number()
-    .int('Limit must be an integer')
-    .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
-    .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
+  limit: z.number().int('Limit must be an integer').min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`).min(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
     .optional(),
   cursor: z.string().optional(),

[Survived] MethodExpression
mcps/slack/tools/search-in-channel.ts:11:10
 export const searchInChannelSchema = z.object({
   query: z.string().min(1, 'Query cannot be empty'),
   channel_id: z.string().min(1, 'Channel ID is required'),
-  limit: z
-    .number()
-    .int('Limit must be an integer')
-    .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
+  limit: z.number().int('Limit must be an integer').max(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
     .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
     .optional(),

[Survived] StringLiteral
mcps/slack/tools/search-in-channel.ts:15:21
     .number()
     .int('Limit must be an integer')
     .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
-    .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
+    .max(MAX_LIMIT, ``)
     .optional(),
   cursor: z.string().optional(),

[Killed] ObjectLiteral
mcps/slack/tools/search-in-channel.ts:32:40
     const params: SlackChannelSearchParams = {
       query: input.query,
       channelId: input.channel_id,
-      ...(input.limit !== undefined && { limit: input.limit }),
+      ...(input.limit !== undefined && {}),
       ...(input.cursor !== undefined && { cursor: input.cursor }),
       ...(input.from_date !== undefined && { fromDate: input.from_date }),
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'important', …(8) } ]

Received: 

  1st vi.fn() call:

@@ -3,11 +3,10 @@
      "channelId": "C888",

[Killed] ObjectLiteral
mcps/slack/tools/search-in-channel.ts:33:41
       query: input.query,
       channelId: input.channel_id,
       ...(input.limit !== undefined && { limit: input.limit }),
-      ...(input.cursor !== undefined && { cursor: input.cursor }),
+      ...(input.cursor !== undefined && {}),
       ...(input.from_date !== undefined && { fromDate: input.from_date }),
       ...(input.to_date !== undefined && { toDate: input.to_date }),
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'important', …(8) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,8 @@
  [

[Killed] ObjectLiteral
mcps/slack/tools/search-in-channel.ts:35:42
       ...(input.limit !== undefined && { limit: input.limit }),
       ...(input.cursor !== undefined && { cursor: input.cursor }),
       ...(input.from_date !== undefined && { fromDate: input.from_date }),
-      ...(input.to_date !== undefined && { toDate: input.to_date }),
+      ...(input.to_date !== undefined && {}),
       ...(input.user_id !== undefined && { userId: input.user_id }),
       ...(input.has_reactions !== undefined && { hasReactions: input.has_reactions }),
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'important', …(8) } ]

Received: 

  1st vi.fn() call:

@@ -5,9 +5,8 @@
      "fromDate": "2024-01-01",

[Killed] ObjectLiteral
mcps/slack/tools/search-in-channel.ts:36:42
       ...(input.cursor !== undefined && { cursor: input.cursor }),
       ...(input.from_date !== undefined && { fromDate: input.from_date }),
       ...(input.to_date !== undefined && { toDate: input.to_date }),
-      ...(input.user_id !== undefined && { userId: input.user_id }),
+      ...(input.user_id !== undefined && {}),
       ...(input.has_reactions !== undefined && { hasReactions: input.has_reactions }),
       ...(input.has_threads !== undefined && { hasThreads: input.has_threads }),
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'important', …(8) } ]

Received: 

  1st vi.fn() call:

@@ -6,8 +6,7 @@
      "hasReactions": true,

[Killed] ObjectLiteral
mcps/slack/tools/search-in-channel.ts:38:46
       ...(input.to_date !== undefined && { toDate: input.to_date }),
       ...(input.user_id !== undefined && { userId: input.user_id }),
       ...(input.has_reactions !== undefined && { hasReactions: input.has_reactions }),
-      ...(input.has_threads !== undefined && { hasThreads: input.has_threads }),
+      ...(input.has_threads !== undefined && {}),
     };
 
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with all parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'important', …(8) } ]

Received: 

  1st vi.fn() call:

@@ -2,11 +2,10 @@
    {

[Killed] ArrayDeclaration
mcps/slack/tools/search-in-channel.ts:44:16
     const results = await client.searchInChannel(params);
 
     return {
-      content: [
-        {
-          type: 'text' as const,
-          text: JSON.stringify(results, null, 2),
-        },
-      ],
+      content: [],
     };
   };
killedBy: createSearchInChannelHandler should call SlackClient.searchInChannel with channel_id
statusReason: expected { content: [] } to deeply equal { content: [ { type: 'text', …(1) } ] }
