[Survived] MethodExpression
mcps/slack/tools/search-messages.ts:9:10
 const MIN_LIMIT = 1;
 
 export const searchMessagesSchema = z.object({
-  query: z.string().min(1, 'Query cannot be empty'),
+  query: z.string().max(1, 'Query cannot be empty'),
   limit: z
     .number()

[Survived] StringLiteral
mcps/slack/tools/search-messages.ts:9:28
 const MIN_LIMIT = 1;
 
 export const searchMessagesSchema = z.object({
-  query: z.string().min(1, 'Query cannot be empty'),
+  query: z.string().min(1, ""),
   limit: z
     .number()

[Survived] MethodExpression
mcps/slack/tools/search-messages.ts:10:10
 
 export const searchMessagesSchema = z.object({
   query: z.string().min(1, 'Query cannot be empty'),
-  limit: z
-    .number()
-    .int('Limit must be an integer')
-    .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
+  limit: z.number().int('Limit must be an integer').max(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
     .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
     .optional(),

[Survived] MethodExpression
mcps/slack/tools/search-messages.ts:10:10
 
 export const searchMessagesSchema = z.object({
   query: z.string().min(1, 'Query cannot be empty'),
-  limit: z
-    .number()
-    .int('Limit must be an integer')
-    .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
-    .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
+  limit: z.number().int('Limit must be an integer').min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`).min(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
     .optional(),
   cursor: z.string().optional(),

[Survived] StringLiteral
mcps/slack/tools/search-messages.ts:13:21
   limit: z
     .number()
     .int('Limit must be an integer')
-    .min(MIN_LIMIT, `Limit must be at least ${MIN_LIMIT}`)
+    .min(MIN_LIMIT, ``)
     .max(MAX_LIMIT, `Limit cannot exceed ${MAX_LIMIT}`)
     .optional(),

[Killed] ObjectLiteral
mcps/slack/tools/search-messages.ts:33:44
       query: input.query,
       ...(input.limit !== undefined && { limit: input.limit }),
       ...(input.cursor !== undefined && { cursor: input.cursor }),
-      ...(input.from_date !== undefined && { fromDate: input.from_date }),
+      ...(input.from_date !== undefined && {}),
       ...(input.to_date !== undefined && { toDate: input.to_date }),
       ...(input.user_id !== undefined && { userId: input.user_id }),
killedBy: createSearchMessagesHandler should handle all optional parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', limit: 10, …(6) } ]

Received: 

  1st vi.fn() call:

@@ -1,9 +1,8 @@
  [

[Killed] ObjectLiteral
mcps/slack/tools/search-messages.ts:36:48
       ...(input.from_date !== undefined && { fromDate: input.from_date }),
       ...(input.to_date !== undefined && { toDate: input.to_date }),
       ...(input.user_id !== undefined && { userId: input.user_id }),
-      ...(input.has_reactions !== undefined && { hasReactions: input.has_reactions }),
+      ...(input.has_reactions !== undefined && {}),
       ...(input.has_threads !== undefined && { hasThreads: input.has_threads }),
     };
killedBy: createSearchMessagesHandler should handle all optional parameters
statusReason: expected "vi.fn()" to be called with arguments: [ { query: 'test', limit: 10, …(6) } ]

Received: 

  1st vi.fn() call:

@@ -1,10 +1,9 @@
  [
